; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image0 - mode
	thermograph1 - mode
	thermograph2 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star8 - direction
	GroundStation12 - direction
	Star13 - direction
	GroundStation16 - direction
	GroundStation17 - direction
	Star19 - direction
	GroundStation1 - direction
	Star15 - direction
	GroundStation10 - direction
	Star7 - direction
	GroundStation5 - direction
	GroundStation9 - direction
	Star18 - direction
	Star4 - direction
	GroundStation14 - direction
	GroundStation11 - direction
	Star6 - direction
	Planet20 - direction
	Planet21 - direction
	Phenomenon22 - direction
	Star23 - direction
	Phenomenon24 - direction
	Phenomenon25 - direction
	Star26 - direction
	Phenomenon27 - direction
	Phenomenon28 - direction
	Planet29 - direction
	Planet30 - direction
	Planet31 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star18)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star15)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 GroundStation14)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation17)
)
(:goal (and
	(have_image Planet20 thermograph2)
	(have_image Planet21 image0)
	(have_image Phenomenon22 infrared3)
	(have_image Star23 infrared3)
	(have_image Phenomenon24 infrared3)
	(have_image Phenomenon25 image0)
	(have_image Star26 thermograph1)
	(have_image Phenomenon27 image0)
	(have_image Phenomenon28 infrared3)
	(have_image Planet29 infrared3)
	(have_image Planet30 thermograph2)
	(have_image Planet31 thermograph2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 phenomenon22 groundstation17)
   deleted: (pointing satellite1 groundstation17)
   added: (pointing satellite1 phenomenon22)
   goals met: 0 of 12
5. (turn_to satellite0 phenomenon25 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon25)
   goals met: 0 of 12
6. (take_image satellite0 phenomenon25 instrument2 image0)
   added: (have_image phenomenon25 image0)
   goals met: 1 of 12
7. (turn_to satellite0 phenomenon27 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon27)
   goals met: 1 of 12
8. (take_image satellite0 phenomenon27 instrument2 image0)
   added: (have_image phenomenon27 image0)
   goals met: 2 of 12
9. (turn_to satellite0 planet20 phenomenon27)
   deleted: (pointing satellite0 phenomenon27)
   added: (pointing satellite0 planet20)
   goals met: 2 of 12
10. (take_image satellite0 planet20 instrument2 thermograph2)
   added: (have_image planet20 thermograph2)
   goals met: 3 of 12
11. (turn_to satellite0 planet21 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet21)
   goals met: 3 of 12
12. (take_image satellite0 planet21 instrument2 image0)
   added: (have_image planet21 image0)
   goals met: 4 of 12
13. (turn_to satellite0 planet30 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 planet30)
   goals met: 4 of 12
14. (take_image satellite0 planet30 instrument2 thermograph2)
   added: (have_image planet30 thermograph2)
   goals met: 5 of 12
15. (turn_to satellite0 planet31 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 planet31)
   goals met: 5 of 12
16. (take_image satellite0 planet31 instrument2 thermograph2)
   added: (have_image planet31 thermograph2)
   goals met: 6 of 12
17. (turn_to satellite0 star26 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 star26)
   goals met: 6 of 12
18. (take_image satellite0 star26 instrument2 thermograph1)
   added: (have_image star26 thermograph1)
   goals met: 7 of 12
19. (turn_to satellite1 star6 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 star6)
   goals met: 7 of 12
20. (calibrate satellite1 instrument3 star6)
   added: (calibrated instrument3)
   goals met: 7 of 12
21. (turn_to satellite1 phenomenon22 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon22)
   goals met: 7 of 12
22. (take_image satellite1 phenomenon22 instrument3 infrared3)
   added: (have_image phenomenon22 infrared3)
   goals met: 8 of 12
23. (turn_to satellite1 phenomenon24 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 phenomenon24)
   goals met: 8 of 12
24. (take_image satellite1 phenomenon24 instrument3 infrared3)
   added: (have_image phenomenon24 infrared3)
   goals met: 9 of 12
25. (turn_to satellite1 phenomenon28 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 phenomenon28)
   goals met: 9 of 12
26. (take_image satellite1 phenomenon28 instrument3 infrared3)
   added: (have_image phenomenon28 infrared3)
   goals met: 10 of 12
27. (turn_to satellite1 planet29 phenomenon28)
   deleted: (pointing satellite1 phenomenon28)
   added: (pointing satellite1 planet29)
   goals met: 10 of 12
28. (take_image satellite1 planet29 instrument3 infrared3)
   added: (have_image planet29 infrared3)
   goals met: 11 of 12
29. (turn_to satellite1 star23 planet29)
   deleted: (pointing satellite1 planet29)
   added: (pointing satellite1 star23)
   goals met: 11 of 12
30. (take_image satellite1 star23 instrument3 infrared3)
   added: (have_image star23 infrared3)
   goals met: 12 of 12
